---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.GetPointLineZone(Autodesk.Revit.DB.UV)
source: html/0a5aeba4-1900-a774-a9f3-7496696abe3e.htm
---
# Autodesk.Revit.DB.FillGrid.GetPointLineZone Method

Gets the index of fill grid line closest to the input 2d point.

## Syntax (C#)
```csharp
public int GetPointLineZone(
	UV point
)
```

## Parameters
- **point** (`Autodesk.Revit.DB.UV`) - Input point.

## Returns
The index of fill grid line.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null